#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/eggs-projects/infra/runs/run-jtroxHFP6YsLANUZ

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.tf_api_token["blog"] will be created
  + resource "github_actions_secret" "tf_api_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "blog"
      + secret_name     = "TF_API_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_repository.projects["blog"] will be created
  + resource "github_repository" "projects" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Blog to track projects, gaming, opinions, etc..."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "blog"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + include_all_branches = false
          + owner                = "michaeldeggers"
          + repository           = "repo_template"
        }
    }

  # tfe_team.dev will be created
  + resource "tfe_team" "dev" {
      + id           = (known after apply)
      + name         = "devs"
      + organization = "eggs-projects"
      + visibility   = "secret"

      + organization_access {
          + manage_modules          = (known after apply)
          + manage_policies         = (known after apply)
          + manage_policy_overrides = (known after apply)
          + manage_providers        = (known after apply)
          + manage_run_tasks        = (known after apply)
          + manage_vcs_settings     = (known after apply)
          + manage_workspaces       = (known after apply)
        }
    }

  # tfe_team_token.dev will be created
  + resource "tfe_team_token" "dev" {
      + id      = (known after apply)
      + team_id = (known after apply)
      + token   = (sensitive value)
    }

  # tfe_workspace.projects["blog"] will be created
  + resource "tfe_workspace" "projects" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + id                            = (known after apply)
      + name                          = "blog"
      + operations                    = (known after apply)
      + organization                  = "eggs-projects"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "project",
        ]
      + terraform_version             = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @michaeldeggers, Action: `pull_request`*